Repository: alexisP3011/EasySave-Group-1
Catalog: Version_1.0/Ressources/string.*.resx
Languages: fr

# WelcomeMessage
source: Welcome to the application!
fr: Bienvenue dans l'application !

# MenuChoices
source: 1. Create a backup works 2. Show all the backup works 3. Delete a backup work 4. Update a backup work 5. Launch a backup work 6. Change the application language 7. Configure log format 8. Exit
fr: 1. Creer un travail de sauvegarde 2. Afficher tous les travaux de sauvegarde 3. Supprimer un travail de sauvegarde 4. Mettre a jour un travail de sauvegarde 5. Lancer un travail de sauvegarde 6. Changer la langue de l'application 7. Quitter

# SelectOption
source: Please select an option:
fr: Veuillez selectionner une option :

# Confirmation
source: Are you sure you want to perform this action? (y/n)
fr: etes-vous sur de vouloir realiser cette action ? (y/n)

# InputError
source: Invalid input. Please try again
fr: Entree invalide. Veuillez reessayer.

# NoBackupAvailable
source: No backup works available.
fr: Aucun travail de sauvegarde disponible.

# Works
source: ---Work {0} --- Name: {1} Source: {2} Target: {3} Type: {4} State: {5}
fr: ---Travail {0}--- Nom : {1} Source : {2} Cible : {3} Type : {4} Etat : {5}

# List
source: Here is the list of your backup works:
fr: Voici la liste des travaux de sauvegarde :

# Work
source: Here is the work details: Name: {0} Source: {1} Target: {2} Type: {3} State: {4}
fr: Voici les details du travail : Nom : {0} Source :{1} Cible : {2} Type : {3} Etat : {4}

# CurrentWork
source: Current work details: Name: {0} Source: {1} Target: {2} Type: {3} State: {4}
fr: Details du travail en cours : Nom : {0} Source :{1} Cible : {2} Type : {3} Etat : {4}

# AskWorkName
source: Please enter the name of the work:
fr: Veuillez entrer le nom du travail :

# LeaveMessage
source: Thank you for using the application. Goodbye!
fr: Merci d'avoir utilise notre application. Au revoir !

# NoWorkAvailable
source: No work available with this name.
fr: Aucun travail disponible avec ce nom.

# CreateWorkMessage
source: Work created successfully!
fr: Travail cree avec succes !

# DeleteWorkMessage
source: Work deleted successfully!
fr: Travail supprime avec succes !

# UpdateWorkMessage
source: Work updated successfully!
fr: Travail mis a jour avec succes !

# ContinueMessage
source: Press any key to continue...
fr: Appuyez sur une touche pour continuer...

# MaxBackupMessage
source: You have reached the maximum number of backup works (5). Please delete one before creating a new one.
fr: Vous avez atteint le nombre maximum de travaux de sauvegarde (5). Veuillez en supprimer un avant d'en creer un nouveau.

# LaunchMessage
source: Launching the backup work...
fr: Lancement du travail de sauvegarde...

# InvalidOption
source: Invalid option. Please try again.
fr: Option invalide. Veuillez reessayer.

# UpdateChoices
source: 1. Name of the backup work 2. Source directory 3. Target directory 4. Type 5. Exit
fr: 1. Nom du travail de sauvegarde 2. Repertoire source 3. Repertoire cible 4. Type 5. Quitter

# AlreadyInProgress
source: A backup work is already underway.
fr: Un travail de sauvegarde est deja en cours.

# AlreadyInUse
source: The selected language is already in use.
fr: La langue selectionnee est deja en cours d'usage.

# AskUpdate
source: Please select the option you want to update:
fr: Veuillez selectionner l'option que vous souhaitez mettre a jour :

# LanguageChoices
source: Our application is available in these two languages: 1. English 2. French
fr: Notre application est disponible dans ces deux langues : 1. Anglais 2. Francais

# ChangeLanguageMessage
source: The language has been changed successfully.
fr: La langue a ete changee avec succes.

# AskSaveName
source: Please enter the name of the backup work:
fr: Veuillez entrer le nom du travail de sauvegarde :

# AskSource
source: Please enter your source:
fr: Veuillez entrer votre source :

# AskTarget
source: Please enter your target:
fr: Veuillez entrer votre cible :

# AskType
source: Please enter the type of the backup work:
fr: Veuillez entrer le type du travail de sauvegarde :

# EnterChoice
source: Enter your choice:
fr: Entrez votre choix :
